pyocd/pyOCD/pyocd/debug/svd/data/M251_v1.svd
       <register>
          <name>PSIO_TRANSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PSIO_TRANSTS</displayName>
          <description>PSIO Transfer Status Register</description>
          <addressOffset>0xC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INFULL0</name>
              <description>Input Data Full Flag0 (Read Only)\nNote: This bit will be cleared automatically when related slot controller start and pin enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin0 input data is empty</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin0 input data is full</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>INOVER0</name>
              <description>Input Data Overflow Flag0\nNote1: When input Overflow happened, it will keep the current data, and discard the upcoming data.\nNote2: When overflow happens, related slot controller will be stopped.\nNote3: This bit can be cleared by configure 1 to it.\nNote4: This bit will be cleared automatically when related slot controller start and pin enabled.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin0 input data does not occur overflow</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin0 input data occurs overflow</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPY0</name>
              <description>Output Data Empty Flag0 (Read Only)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin0 output data is full</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin0 output data is empty</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTUF0</name>
              <description>Output Data Underflow Flag0\nWhen PSIO is still output data but PSIOn_OUTDAT have not been ready. This flag will be set to 1.\nNote1: When output data shortage happened, it will output 0.\nNote2: When underflow happens, related slot controller will be stopped.\nNote3: This bit can be cleared by configure 1 to it.\nNote4: This bit will be cleared automatically when related slot controller start and pin enabled.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin0 output data is not overflow</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin0 output data is overflow</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INFULL1</name>
              <description>Input Data Full Flag1 (Read Only)\nNote: This bit will be cleared automatically when related slot controller start and pin enabled.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin1 input data is empty</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin1 input data is full</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>INOVER1</name>
              <description>Input Data Overflow Flag1\nNote1: When input Overflow happened, it will keep the current data, and discard the upcoming data.\nNote2: When overflow happens, related slot controller will be stopped.\nNote3: This bit can be cleared by configure 1 to it.\nNote4: This bit will be cleared automatically when related slot controller start and pin enabled.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin1 input data does not occur overflow</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin1 input data occurs overflow</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPY1</name>
              <description>Output Data Empty Flag1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin1 output data is full</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin1 output data is empty</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTUF1</name>
              <description>Output Data Underflow Flag1\nWhen PSIO is still output data but PSIOn_OUTDAT have not been ready. This flag will be set to 1.\nNote1: When output data shortage happened, it will output 0.\nNote2: When underflow happens, related slot controller will be stopped.\nNote3: This bit can be cleared by configure 1 to it.\nNote4: This bit will be cleared automatically when related slot controller start and pin enabled</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin1 output data is not overflow</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin1 output data is overflow</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INFULL2</name>
              <description>Input Data Full Flag2 (Read Only)\nNote: This bit will be cleared automatically when related slot controller start and pin is enabled.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin2 input data is empty</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin2 input data is full</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>INOVER2</name>
              <description>Input Data Overflow Flag2\nNote1: When input Overflow happened, it will keep the current data, and discard the upcoming data.\nNote2: When overflow happens, related slot controller will be stopped.\nNote3: This bit can be cleared by configure 1 to it.\nNote4: This bit will be cleared automatically when related slot controller start and pin enabled.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin2 input data does not occur overflow</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin2 input data occurs overflow</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPY2</name>
              <description>Output Data Empty Flag2 (Read Only)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin2 output data is full</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin2 output data is empty</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTUF2</name>
              <description>Output Data Underflow Flag2\nWhen PSIO is still output data but PSIOn_OUTDAT have not been ready. This flag will be set to 1.\nNote1: When output data shortage happened, it will output 0.\nNote2: When underflow happens, related slot controller will be stopped.\nNote3: This bit can be cleared by configure 1 to it.\nNote4: This bit will be cleared automatically when related slot controller start and pin enabled.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin3 output data is not overflow</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin3 output data is overflow</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INFULL3</name>
              <description>Input Data Full Flag3 (Read Only)\nNote: This bit will be cleared automatically when related slot controller start and pin is enabled.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin3 input data is empty</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin3 input data is full</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>INOVER3</name>
              <description>Input Data Overflow Flag3\nNote1: When input Overflow happened, it will keep the current data, and discard the upcoming data.\nNote2: When overflow happens, related slot controller will be stopped.\nNote3: This bit can be cleared by configure 1 to it.\nNote4: This bit will be cleared automatically when related slot controller start and pin enabled.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin3 input data does not occur overflow</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin3 input data occurs overflow</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPY3</name>
              <description>Output Data Empty Flag3 (Read Only)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin3 output data is full</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin3 output data is empty</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTUF3</name>
              <description>Output Data Underflow Flag3\nWhen PSIO is still output data but PSIOn_OUTDAT have not been ready. This flag will be set to 1.\nNote1: When output data shortage happened, it will output 0.\nNote2: When underflow happens, related slot controller will be stopped.\nNote3: This bit can be cleared by configure 1 to it.\nNote4: This bit will be cleared automatically when related slot controller start and pin enabled.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin3 output data is not overflow</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin3 output data is overflow</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INFULL4</name>
              <description>Input Data Full Flag4 (Read Only)\nNote: This bit will be cleared automatically when related slot controller start and pin is enabled.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin4 input data is empty</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin4 input data is full</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>INOVER4</name>
              <description>Input Data Overflow Flag4\nNote1: When input Overflow happened, it will keep the current data, and discard the upcoming data.\nNote2: When overflow happens, related slot controller will be stopped.\nNote3: This bit can be cleared by configure 1 to it.\nNote4: This bit will be cleared automatically when related slot controller start and pin enabled.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin4 input data does not occur overflow</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin4 input data occurs overflow</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPY4</name>
              <description>Output Data Empty Flag4 (Read Only)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin4 output data is full</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin4 output data is empty</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTUF4</name>
              <description>Output Data Underflow Flag4\nWhen PSIO is still output data but PSIOn_OUTDAT have not been ready. This flag will be set to 1.\nNote1: When output data shortage happened, it will output 0.\nNote2: When underflow happens, related slot controller will be stopped.\nNote3: This bit can be cleared by configure 1 to it.\nNote4: This bit will be cleared automatically when related slot controller start and pin enabled.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin4 output data is not overflow</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin4 output data is overflow</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INFULL5</name>
              <description>Input Data Full Flag5 (Read Only)\nNote: This bit will be cleared automatically when related slot controller start and pin enabled.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin5 input data is empty</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin5 input data is full</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>INOVER5</name>
              <description>Input Data Overflow Flag5\nNote1: When input Overflow happened, it will keep the current data, and discard the upcoming data.\nNote2: When overflow happens, related slot controller will be stopped.\nNote3: This bit can be cleared by configure 1 to it.\nNote4: This bit will be cleared automatically when related slot controller start and pin enabled.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin5 input data does not occur overflow</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin5 input data occurs overflow</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEPY5</name>
              <description>Output Data Empty Flag5 (Read Only)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pin5 output data is full</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pin5 output data is empty</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTUF5</name>
              <description>Output Data Underflow Flag5\nWhen PSIO is still output data but PSIOn_OUTDAT have not been ready. This flag will be set to 1.\nNote1: When output data shortage happened, it will output 0.\nNote2: When underflow happens, related slot controller will be stopped.\nNote3: This bit can be cleared by configure 1 to it.\nNote4: This bit will be cleared automatically when related slot controller start and pin is enabled.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
