pyocd/pyOCD/pyocd/debug/svd/data/M251_v1.svd
       <register>
          <name>PSIO_SC0CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PSIO_SC0CTL</displayName>
          <description>PSIO Slot Controller n Control Register</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x02000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INISLOT</name>
              <description>Initial Slot Period\nThe initial slot of the repeat period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No use</description>
                    <value>#0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SLOT0</description>
                    <value>#0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>SLOT1</description>
                    <value>#0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>SLOT2</description>
                    <value>#0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>SLOT3</description>
                    <value>#0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>SLOT4</description>
                    <value>#0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>SLOT5</description>
                    <value>#0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>SLOT6</description>
                    <value>#0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>SLOT7</description>
                    <value>#1000</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDSLOT</name>
              <description>End Slot Period\nThe end slot of the repeat period</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No use</description>
                    <value>#0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SLOT0</description>
                    <value>#0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>SLOT1</description>
                    <value>#0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>SLOT2</description>
                    <value>#0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>SLOT3</description>
                    <value>#0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>SLOT4</description>
                    <value>#0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>SLOT5</description>
                    <value>#0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>SLOT6</description>
                    <value>#0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>SLOT7</description>
                    <value>#1000</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLCNT</name>
              <description>Slot Period Loop Count\n000000 ~ 111110: loop count\nNote1: If setting this register 111111 with PDMA mode and OUTPUT mode, it will stop automatically when PDMA is finished and output data in shift register is finished.\nNote2: If setting this register 111111 with PDMA mode and INPUT mode, it will stop automatically when pdma is finished.\nNote3: If PSIO receives stop instruction during repeat mode, it will stop only when the current loop is finished.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>slot period loop count function is disable</description>
                    <value>#000000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>repeat selection loop once, which means total go through selected repeat slots 2 times</description>
                    <value>#000001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>63</name>
                    <description>loop until stop PSIO slot controller</description>
                    <value>#111111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGSRC</name>
              <description>PSIO_SCn Trigger Source\nNote1: PSIO slot controller pin can only be triggered by related pins set from PSIOn_GENCTL[25:24] SC_SEL.\nNote2: Configuring rising or falling signal trigger PSIO, the signal needs to hold for at least two PSIO_CLK for de-bounce or PSIO will not be triggered.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Trigger by software</description>
                    <value>00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Trigger PSIO_SCn when related PSIO_PIN occurred falling edge</description>
                    <value>01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Trigger PSIO_SCn when related PSIO_PIN occurred rising edge</description>
                    <value>02</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Trigger PSIO_SCn when related PSIO_PIN occurred rising edge or falling edge</description>
                    <value>03</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>START</name>
              <description>PSIO_SCn Start\nNote: this bit is always read as 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No use</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Start PSIO_SCn to count and active related PSIO_PIN</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>REPEAT</name>
              <description>Whole Repeat Mode\nSlot controller repeats counting forever. It can stop by clear START bit.\nNote1: If this bit is enabled with PDMA mode, slot controller will stop automatically when the PDMA finishes transferring number of data.\nNote2: If PSIO receives stop instruction during repeat mode, it will stop only when the current loop is finished.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Repeat mode Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Repeat mode Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>PSIO_SCn Stop\nNote: This bit is always read as 0.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No use</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Stop PSIO_SCn</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>PSIO_SCn Busy Flag\nNote: This bit will be set to 1 when slot controller start to count automatically and it will be cleared to 0 automatically when slot controller stop counting, too.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PSIO_SCn is not busy</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PSIO_SCn is busy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLE</name>
              <description>PSIO_SCn Idle Flag\nNote1: This bit will be cleared to 0 when slot controller start to count automatically. \nNote2: This bit will be set to 1 when configuring it 1 by software. \nNote3: This bit is set to distinguish INTERVAL_OUTPUT(PSIOn_GENCTL[5:4]) and INITIAL_OUTPUT(PSIOn_GENCTL[3:2]).</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PSIO_SCn is not IDLE</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PSIO_SCn is IDLE</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PSIO_SC0CTL">
          <name>PSIO_SC1CTL</name>
          <displayName>PSIO_SC1CTL</displayName>
          <description>PSIO Slot Controller n Control Register</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="PSIO_SC0CTL">
          <name>PSIO_SC2CTL</name>
          <displayName>PSIO_SC2CTL</displayName>
          <description>PSIO Slot Controller n Control Register</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="PSIO_SC0CTL">
          <name>PSIO_SC3CTL</name>
          <displayName>PSIO_SC3CTL</displayName>
          <description>PSIO Slot Controller n Control Register</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register>
          <name>PSIO_SC0SLOT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PSIO_SC0SLOT</displayName>
          <description>PSIO Slot Controller n Slot Register</description>
          <addressOffset>0x24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SLOT0</name>
              <description>PSIO Slot Controller Slot0 Tick Count\n0 to 15\nNote1: Filling in all 0 to this field indicates to disable this slot.\nNote2: The disabled slot should not be set between the enabled slots, or the order of enabled slot which is after the disabled slot will not be enable.\nNote3: The shortest slot length is 6 when I/O mode is switched from output mode to input mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOT1</name>
              <description>PSIO Slot Controller Slot1 Tick Count\n0 to 15\nNote1: Filling in all 0 to this field indicates to disable this slot.\nNote2: The disabled slot should not be set between the enabled slots, or the order of enabled slot which is after the disabled slot will not be enable.\nNote3: The shortest slot length is 6 when I/O mode is switched from output mode to input mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOT2</name>
              <description>PSIO Slot Controller Slot2 Tick Count\n0 to 15\nNote1: Filling in all 0 to this field indicates to disable this slot.\nNote2: The disabled slot should not be set between the enabled slots, or the order of enabled slot which is after the disabled slot will not be enable.\nNote3: The shortest slot length is 6 when I/O mode is switched from output mode to input mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOT3</name>
              <description>PSIO Slot Controller Slot3 Tick Count\n0 to 15.\nNote1: Filling in all 0 to this field indicates to disable this slot.\nNote2: The disabled slot should not be set between the enabled slots, or the order of enabled slot which is after the disabled slot will not be enable.\nNote3: The shortest slot length is 6 when I/O mode is switched from output mode to input mode.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOT4</name>
              <description>PSIO Slot Controller Slot4 Tick Count\n0 to 15\nNote1: Filling in all 0 to this field indicates to disable this slot.\nNote2: The disabled slot should not be set between the enabled slots, or the order of enabled slot which is after the disabled slot will not be enable.\nNote3: The shortest slot length is 6 when I/O mode is switched from output mode to input mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOT5</name>
              <description>PSIO Slot Controller Slot5 Tick Count\n0 to 15\nNote1: Filling in all 0 to this field indicates to disable this slot.\nNote2: The disabled slot should not be set between the enabled slots, or the order of enabled slot which is after the disabled slot will not be enable.\nNote3: The shortest slot length is 6 when I/O mode is switched from output mode to input mode.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOT6</name>
              <description>PSIO Slot Controller Slot6 Tick Count\n0 to 15\nNote1: Filling in all 0 to this field indicates to disable this slot.\nNote2: The disabled slot should not be set between the enabled slots, or the order of enabled slot which is after the disabled slot will not be enable.\nNote3: The shortest slot length is 6 when I/O mode is switched from output mode to input mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOT7</name>
              <description>PSIO Slot Controller Slot7 Tick Count\n0 to 15\nNote1: Filling in all 0 to this field indicates to disable this slot.\nNote2: The disabled slot should not be set between the enabled slots, or the order of enabled slot which is after the disabled slot will not be enable.\nNote3: The shortest slot length is 6 when I/O mode is switched from output mode to input mode.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
