pyocd/pyOCD/pyocd/debug/svd/data/M251_v1.svd
       <register>
          <name>PSIO0_CPCTL0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PSIO0_CPCTL0</displayName>
          <description>PSIOn Check Point Control 0 Register</description>
          <addressOffset>0x54</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CKPT0</name>
              <description>Check Point 0\nNote1: If there are two check points that select the same SLOT, the pin will follow settings of the smaller check point number.\nNote2: The correlated SLOT should be filled in order from SLOT0 to SLOT7, or the check point action will not be triggered.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No use</description>
                    <value>0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SLOT0</description>
                    <value>0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>SLOT1</description>
                    <value>0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>SLOT2</description>
                    <value>0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>100</name>
                    <description>SLOT3</description>
                    <value>0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>101</name>
                    <description>SLOT4</description>
                    <value>0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>110</name>
                    <description>SLOT5</description>
                    <value>0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>111</name>
                    <description>SLOT6</description>
                    <value>0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1000</name>
                    <description>SLOT6</description>
                    <value>1000</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CKPT1</name>
              <description>Check Point 1\nNote1: If there are two check points that select the same SLOT, the pin will follow settings of the smaller check point number.\nNote2: The correlated SLOT should be filled in order from SLOT0 to SLOT7, or the check point action will not be triggered.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No use</description>
                    <value>0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SLOT0</description>
                    <value>0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>SLOT1</description>
                    <value>0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>SLOT2</description>
                    <value>0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>100</name>
                    <description>SLOT3</description>
                    <value>0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>101</name>
                    <description>SLOT4</description>
                    <value>0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>110</name>
                    <description>SLOT5</description>
                    <value>0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>111</name>
                    <description>SLOT6</description>
                    <value>0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1000</name>
                    <description>SLOT6</description>
                    <value>1000</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CKPT2</name>
              <description>Check Point 2\nNote1: If there are two check points that select the same SLOT, the pin will follow settings of the smaller check point number.\nNote2: The correlated SLOT should be filled in order from SLOT0 to SLOT7, or the check point action will not be triggered.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No use</description>
                    <value>0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SLOT0</description>
                    <value>0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>SLOT1</description>
                    <value>0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>SLOT2</description>
                    <value>0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>100</name>
                    <description>SLOT3</description>
                    <value>0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>101</name>
                    <description>SLOT4</description>
                    <value>0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>110</name>
                    <description>SLOT5</description>
                    <value>0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>111</name>
                    <description>SLOT6</description>
                    <value>0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1000</name>
                    <description>SLOT6</description>
                    <value>1000</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CKPT3</name>
              <description>Check Point 3\nNote1: If there are two check points that select the same SLOT, the pin will follow settings of the smaller check point number.\nNote2: The correlated SLOT should be filled in order from SLOT0 to SLOT7, or the check point action will not be triggered</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No use</description>
                    <value>0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SLOT0</description>
                    <value>0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>SLOT1</description>
                    <value>0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>SLOT2</description>
                    <value>0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>100</name>
                    <description>SLOT3</description>
                    <value>0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>101</name>
                    <description>SLOT4</description>
                    <value>0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>110</name>
                    <description>SLOT5</description>
                    <value>0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>111</name>
                    <description>SLOT6</description>
                    <value>0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1000</name>
                    <description>SLOT6</description>
                    <value>1000</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CKPT4</name>
              <description>Check Point 4\nNote1: If there are two check points that select the same SLOT, the pin will follow settings of the smaller check point number.\nNote2: The correlated SLOT should be filled in order from SLOT0 to SLOT7, or the check point action will not be triggered.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No use</description>
                    <value>0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SLOT0</description>
                    <value>0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>SLOT1</description>
                    <value>0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>SLOT2</description>
                    <value>0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>100</name>
                    <description>SLOT3</description>
                    <value>0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>101</name>
                    <description>SLOT4</description>
                    <value>0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>110</name>
                    <description>SLOT5</description>
                    <value>0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>111</name>
                    <description>SLOT6</description>
                    <value>0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1000</name>
                    <description>SLOT6</description>
                    <value>1000</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CKPT5</name>
              <description>Check Point 5\nNote1: If there are two check points that select the same SLOT, the pin will follow settings of the smaller check point number.\nNote2: The correlated SLOT should be filled in order from SLOT0 to SLOT7, or the check point action will not be triggered.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No use</description>
                    <value>0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SLOT0</description>
                    <value>0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>SLOT1</description>
                    <value>0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>SLOT2</description>
                    <value>0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>100</name>
                    <description>SLOT3</description>
                    <value>0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>101</name>
                    <description>SLOT4</description>
                    <value>0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>110</name>
                    <description>SLOT5</description>
                    <value>0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>111</name>
                    <description>SLOT6</description>
                    <value>0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1000</name>
                    <description>SLOT6</description>
                    <value>1000</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CKPT6</name>
              <description>Check Point 6\nNote1: If there are two check points that select the same SLOT, the pin will follow settings of the smaller check point number.\nNote2: The correlated SLOT should be filled in order from SLOT0 to SLOT7, or the check point action will not be triggered.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No use</description>
                    <value>0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SLOT0</description>
                    <value>0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>SLOT1</description>
                    <value>0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>SLOT2</description>
                    <value>0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>100</name>
                    <description>SLOT3</description>
                    <value>0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>101</name>
                    <description>SLOT4</description>
                    <value>0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>110</name>
                    <description>SLOT5</description>
                    <value>0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>111</name>
                    <description>SLOT6</description>
                    <value>0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1000</name>
                    <description>SLOT6</description>
                    <value>1000</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CKPT7</name>
              <description>Check Point 7\nThis field is used to link check point and slot controller slot.\nNote1: If there are two check points that select the same SLOT, the pin will follow settings of the smaller check point number.\nNote2: The correlated SLOT should be filled in order from SLOT0 to SLOT7, or the check point action will not be triggered.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No use</description>
                    <value>0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SLOT0</description>
                    <value>0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>SLOT1</description>
                    <value>0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>SLOT2</description>
                    <value>0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>100</name>
                    <description>SLOT3</description>
                    <value>0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>101</name>
                    <description>SLOT4</description>
                    <value>0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>110</name>
                    <description>SLOT5</description>
                    <value>0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>111</name>
                    <description>SLOT6</description>
                    <value>0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1000</name>
                    <description>SLOT7</description>
                    <value>1000</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PSIO0_CPCTL0">
          <name>PSIO1_CPCTL0</name>
          <displayName>PSIO1_CPCTL0</displayName>
          <description>PSIOn Check Point Control 0 Register</description>
          <addressOffset>0x74</addressOffset>
       </register>
       <register derivedFrom="PSIO0_CPCTL0">
          <name>PSIO2_CPCTL0</name>
          <displayName>PSIO2_CPCTL0</displayName>
          <description>PSIOn Check Point Control 0 Register</description>
          <addressOffset>0x94</addressOffset>
       </register>
       <register derivedFrom="PSIO0_CPCTL0">
          <name>PSIO3_CPCTL0</name>
          <displayName>PSIO3_CPCTL0</displayName>
          <description>PSIOn Check Point Control 0 Register</description>
          <addressOffset>0xB4</addressOffset>
       </register>
       <register derivedFrom="PSIO0_CPCTL0">
          <name>PSIO4_CPCTL0</name>
          <displayName>PSIO4_CPCTL0</displayName>
          <description>PSIOn Check Point Control 0 Register</description>
          <addressOffset>0xD4</addressOffset>
       </register>
       <register derivedFrom="PSIO0_CPCTL0">
          <name>PSIO5_CPCTL0</name>
          <displayName>PSIO5_CPCTL0</displayName>
          <description>PSIOn Check Point Control 0 Register</description>
          <addressOffset>0xF4</addressOffset>
       </register>
       <register derivedFrom="PSIO0_CPCTL0">
          <name>PSIO6_CPCTL0</name>
          <displayName>PSIO6_CPCTL0</displayName>
          <description>PSIOn Check Point Control 0 Register</description>
          <addressOffset>0x114</addressOffset>
       </register>
       <register derivedFrom="PSIO0_CPCTL0">
          <name>PSIO7_CPCTL0</name>
          <displayName>PSIO7_CPCTL0</displayName>
          <description>PSIOn Check Point Control 0 Register</description>
          <addressOffset>0x134</addressOffset>
       </register>
