pyocd/pyOCD/pyocd/debug/svd/data/M251_v1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CRYPTO</name>
      <description>CRYPTO Register Map</description>
      <groupName>CRYPTO</groupName>
      <baseAddress>0x50080000</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x4C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>CRYPTO_INTEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_INTEN</displayName>
          <description>Crypto Interrupt Enable Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AESIEN</name>
              <description>AES Interrupt Enable Bit\nNote: In DMA mode, an interrupt will be triggered when amount of data set in AES_DMA_CNT is fed into the AES engine.\nIn Non-DMA mode, an interrupt will be triggered when the AES engine finishes the operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>AES interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>AES interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>AESEIEN</name>
              <description>AES Error Flag Enable Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>AES error interrupt flag Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>AES error interrupt flag Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PRNGIEN</name>
              <description>PRNG Interrupt Enable Bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PRNG interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PRNG interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_INTSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_INTSTS</displayName>
          <description>Crypto Interrupt Flag</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AESIF</name>
              <description>AES Finish Interrupt Flag\nNote: This bit is cleared by writing 1, and it has no effect by writing 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No AES interrupt</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>AES encryption/decryption done interrupt</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>AESEIF</name>
              <description>AES Error Flag\nNote: This bit is cleared by writing 1, and it has no effect by writing 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No AES error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>AES encryption/decryption error interrupt</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PRNGIF</name>
              <description>PRNG Finish Interrupt Flag\nNote: This bit is cleared by writing 1, and it has no effect by writing 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No PRNG interrupt</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PRNG key generation done interrupt</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_PRNG_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_PRNG_CTL</displayName>
          <description>PRNG Control Register</description>
          <addressOffset>0x8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>Start PRNG Engine</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Stop PRNG engine</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Generate new key and store the new key to register CRYPTO_PRNG_KEYx, which will be cleared when the new key is generated</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SEEDRLD</name>
              <description>Reload New Seed for PRNG Engine</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Generating key based on the current seed</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reload new seed</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>KEYSZ</name>
              <description>PRNG Generate Key Size</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>64 bits</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>128 bits</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>192 bits</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>256 bits</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>PRNG Busy (Read Only)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PRNG engine is idle</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Indicate that the PRNG engine is generating CRYPTO_PRNG_KEYx</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_PRNG_SEED</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_PRNG_SEED</displayName>
          <description>Seed for PRNG</description>
          <addressOffset>0xC</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>SEED</name>
              <description>Seed for PRNG (Write Only)\nThe bits store the seed for PRNG engine.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_PRNG_KEY0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_PRNG_KEY0</displayName>
          <description>PRNG Generated Key0</description>
          <addressOffset>0x10</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>Store PRNG Generated Key (Read Only)\nThe bits store the key that is generated by PRNG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_PRNG_KEY0">
          <name>CRYPTO_PRNG_KEY1</name>
          <displayName>CRYPTO_PRNG_KEY1</displayName>
          <description>PRNG Generated Key1</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_PRNG_KEY0">
          <name>CRYPTO_PRNG_KEY2</name>
          <displayName>CRYPTO_PRNG_KEY2</displayName>
          <description>PRNG Generated Key2</description>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_PRNG_KEY0">
          <name>CRYPTO_PRNG_KEY3</name>
          <displayName>CRYPTO_PRNG_KEY3</displayName>
          <description>PRNG Generated Key3</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_PRNG_KEY0">
          <name>CRYPTO_PRNG_KEY4</name>
          <displayName>CRYPTO_PRNG_KEY4</displayName>
          <description>PRNG Generated Key4</description>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_PRNG_KEY0">
          <name>CRYPTO_PRNG_KEY5</name>
          <displayName>CRYPTO_PRNG_KEY5</displayName>
          <description>PRNG Generated Key5</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_PRNG_KEY0">
          <name>CRYPTO_PRNG_KEY6</name>
          <displayName>CRYPTO_PRNG_KEY6</displayName>
          <description>PRNG Generated Key6</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_PRNG_KEY0">
          <name>CRYPTO_PRNG_KEY7</name>
          <displayName>CRYPTO_PRNG_KEY7</displayName>
          <description>PRNG Generated Key7</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register>
          <name>CRYPTO_AES_FDBCK0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES_FDBCK0</displayName>
          <description>AES Engine Output Feedback Data After Cryptographic Operation</description>
          <addressOffset>0x50</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FDBCK</name>
              <description>AES Feedback Information\nThe feedback value is 128 bits in size.\nThe AES engine uses the data from CRYPTO_AES_FDBCKx as the data inputted to CRYPTO_AES_IVx for the next block in DMA cascade mode.\nThe AES engine outputs feedback information for IV in the next block's operation. Software can store that feedback value temporarily. After switching back, fill the stored feedback value to CRYPTO_AES_IVx in the same channel operation, and then continue the operation with the original setting.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_AES_FDBCK0">
          <name>CRYPTO_AES_FDBCK1</name>
          <displayName>CRYPTO_AES_FDBCK1</displayName>
          <description>AES Engine Output Feedback Data After Cryptographic Operation</description>
          <addressOffset>0x54</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES_FDBCK0">
          <name>CRYPTO_AES_FDBCK2</name>
          <displayName>CRYPTO_AES_FDBCK2</displayName>
          <description>AES Engine Output Feedback Data After Cryptographic Operation</description>
          <addressOffset>0x58</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES_FDBCK0">
          <name>CRYPTO_AES_FDBCK3</name>
          <displayName>CRYPTO_AES_FDBCK3</displayName>
          <description>AES Engine Output Feedback Data After Cryptographic Operation</description>
          <addressOffset>0x5C</addressOffset>
       </register>
