pyocd/pyOCD/pyocd/debug/svd/data/M251_v1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EADC</name>
      <description>EADC Register Map</description>
      <groupName>EADC</groupName>
      <baseAddress>0x40043000</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x60</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x80</offset>
        <size>0x4C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x110</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x130</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x140</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x208</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>EADC_DAT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_DAT0</displayName>
          <description>ADC Data Register 0 for Sample Module 0</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESULT</name>
              <description>ADC Conversion Result\nThis field contains 12 bits conversion result.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OV</name>
              <description>Overrun Flag\nIf converted data in RESULT[11:0] has not been read before new conversion result is loaded to this register, OV is set to 1.\nNote: It is cleared by hardware after EADC_DAT register is read.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data in RESULT[11:0] is recent conversion result</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data in RESULT[11:0] is overwrite</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Valid Flag\nThis bit is set to 1 when corresponding sample module channel analog input conversion is completed and cleared by hardware after EADC_DAT register is read.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data in RESULT[11:0] bits is not valid</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data in RESULT[11:0] bits is valid</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC_DAT0">
          <name>EADC_DAT1</name>
          <displayName>EADC_DAT1</displayName>
          <description>ADC Data Register 1 for Sample Module 1</description>
          <addressOffset>0x4</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT0">
          <name>EADC_DAT2</name>
          <displayName>EADC_DAT2</displayName>
          <description>ADC Data Register 2 for Sample Module 2</description>
          <addressOffset>0x8</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT0">
          <name>EADC_DAT3</name>
          <displayName>EADC_DAT3</displayName>
          <description>ADC Data Register 3 for Sample Module 3</description>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT0">
          <name>EADC_DAT4</name>
          <displayName>EADC_DAT4</displayName>
          <description>ADC Data Register 4 for Sample Module 4</description>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT0">
          <name>EADC_DAT5</name>
          <displayName>EADC_DAT5</displayName>
          <description>ADC Data Register 5 for Sample Module 5</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT0">
          <name>EADC_DAT6</name>
          <displayName>EADC_DAT6</displayName>
          <description>ADC Data Register 6 for Sample Module 6</description>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT0">
          <name>EADC_DAT7</name>
          <displayName>EADC_DAT7</displayName>
          <description>ADC Data Register 7 for Sample Module 7</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT0">
          <name>EADC_DAT8</name>
          <displayName>EADC_DAT8</displayName>
          <description>ADC Data Register 8 for Sample Module 8</description>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT0">
          <name>EADC_DAT9</name>
          <displayName>EADC_DAT9</displayName>
          <description>ADC Data Register 9 for Sample Module 9</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT0">
          <name>EADC_DAT10</name>
          <displayName>EADC_DAT10</displayName>
          <description>ADC Data Register 10 for Sample Module 10</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT0">
          <name>EADC_DAT11</name>
          <displayName>EADC_DAT11</displayName>
          <description>ADC Data Register 11 for Sample Module 11</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT0">
          <name>EADC_DAT12</name>
          <displayName>EADC_DAT12</displayName>
          <description>ADC Data Register 12 for Sample Module 12</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT0">
          <name>EADC_DAT13</name>
          <displayName>EADC_DAT13</displayName>
          <description>ADC Data Register 13 for Sample Module 13</description>
          <addressOffset>0x34</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT0">
          <name>EADC_DAT14</name>
          <displayName>EADC_DAT14</displayName>
          <description>ADC Data Register 14 for Sample Module 14</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT0">
          <name>EADC_DAT15</name>
          <displayName>EADC_DAT15</displayName>
          <description>ADC Data Register 15 for Sample Module 15</description>
          <addressOffset>0x3C</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT0">
          <name>EADC_DAT16</name>
          <displayName>EADC_DAT16</displayName>
          <description>ADC Data Register 16 for Sample Module 16</description>
          <addressOffset>0x40</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT0">
          <name>EADC_DAT17</name>
          <displayName>EADC_DAT17</displayName>
          <description>ADC Data Register 17 for Sample Module 17</description>
          <addressOffset>0x44</addressOffset>
       </register>
       <register derivedFrom="EADC_DAT0">
          <name>EADC_DAT18</name>
          <displayName>EADC_DAT18</displayName>
          <description>ADC Data Register 18 for Sample Module 18</description>
          <addressOffset>0x48</addressOffset>
       </register>
       <register>
          <name>EADC_CURDAT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_CURDAT</displayName>
          <description>EADC PDMA Current Transfer Data Register</description>
          <addressOffset>0x4C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURDAT</name>
              <description>EADC PDMA Current Transfer Data (Read Only)\nNote: After PDMA reads this register, the VAILD of the shadow EADC_DAT register will be automatically cleared.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EADC_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_CTL</displayName>
          <description>ADC Control Register</description>
          <addressOffset>0x50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00040000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EADCEN</name>
              <description>ADC Converter Enable Bit\nNote: Before starting ADC conversion function, this bit should be set to 1. Clear it to 0 to disable ADC converter analog circuit power consumption.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disabled EADC</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enabled EADC</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EADCRST</name>
              <description>EADC ADC Converter Control Circuits Reset\nNote: EADCRST bit remains 1 during EADC reset. When EADC reset end, the EADCRST bit is automatically cleared to 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Cause EADC control circuits reset to initial state, but not change the EADC registers value</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EADCIEN0</name>
              <description>Specific Sample Module ADC ADINT0 Interrupt Enable Bit\nThe ADC converter generates a conversion end ADIF0 (EADC_STATUS2[0]) upon the end of specific sample module ADC conversion. If EADCIEN0 bit is set then conversion end interrupt request ADINT0 is generated.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Specific sample module ADC ADINT0 interrupt function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Specific sample module ADC ADINT0 interrupt function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EADCIEN1</name>
              <description>Specific Sample Module ADC ADINT1 Interrupt Enable Bit\nThe ADC converter generates a conversion end ADIF1 (EADC_STATUS2[1]) upon the end of specific sample module ADC conversion. If EADCIEN1 bit is set then conversion end interrupt request ADINT1 is generated.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Specific sample module ADC ADINT1 interrupt function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Specific sample module ADC ADINT1 interrupt function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EADCIEN2</name>
              <description>Specific Sample Module ADC ADINT2 Interrupt Enable Bit\nThe ADC converter generates a conversion end ADIF2 (EADC_STATUS2[2]) upon the end of specific sample module ADC conversion. If EADCIEN2 bit is set then conversion end interrupt request ADINT2 is generated.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Specific sample module ADC ADINT2 interrupt function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Specific sample module ADC ADINT2 interrupt function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EADCIEN3</name>
              <description>Specific Sample Module ADC ADINT3 Interrupt Enable Bit\nThe ADC converter generates a conversion end ADIF3 (EADC_STATUS2[3]) upon the end of specific sample module ADC conversion. If EADCIEN3 bit is set then conversion end interrupt request ADINT3 is generated.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Specific sample module ADC ADINT3 interrupt function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Specific sample module ADC ADINT3 interrupt function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EADC_SWTRG</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_SWTRG</displayName>
          <description>ADC Sample Module Software Start Register</description>
          <addressOffset>0x54</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWTRG</name>
              <description>ADC Sample Module 0~18 Software Force to Start EADC Conversion\nNote: After writing this register to start EADC conversion,  the EADC_PENDSTS register will show which sample module will conversion. If user want to disable the conversion of the sample module, user can write EADC_PENDSTS register to clear it.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Cause an EADC conversion when the priority is given to sample module</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EADC_PENDSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_PENDSTS</displayName>
          <description>ADC Start of Conversion Pending Flag Register</description>
          <addressOffset>0x58</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STPF</name>
              <description>ADC Sample Module 0~18 Start of Conversion Pending Flag\nRead Operation:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>There is no pending conversion for sample module</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample module EADC start of conversion is pending.\nClear pending flag and stop conversion for corresponding sample module</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EADC_OVSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_OVSTS</displayName>
          <description>ADC Sample Module Start of Conversion Overrun Flag Register</description>
          <addressOffset>0x5C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPOVF</name>
              <description>ADC SAMPLE0~18 Overrun Flag\nNote: This bit is cleared by writing 1 to it.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No sample module event overrun</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Indicates a new sample module event is generated while an old one event is pending</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
